back/socketio-load-test.yaml
config:
  target: "http://api.workadventure.localhost/"
  socketio:
    transports: ["websocket"]
    query:
      token: "test"
  phases:
    - duration: 10
      arrivalRate: 10
    - duration: 10
      arrivalRate: 10
  processor: "./socketioLoadTest.js"
scenarios:
  - name: "Connect and send a bunch of messages"
    weight: 90
    engine: "socketio"
    flow:
      #- loop:
      #- emit:
      #    channel: "connection"
      #    data: "hello world!"
      #- think: 5
      - emit:
          channel: "set-player-details"
          data:
            name: 'TEST'
            characterLayers: ['male3']
      - think: 1
      - emit:
          channel: "join-room"
          data:
            roomId: 'global__api.workadventure.localhost/map/files/Floor0/floor0'
            position:
              x: 783
              y: 170
              direction: 'down'
              moving: false
      - think: 1
      - loop:
        - function: "setYRandom"
        - emit:
            channel: "user-position"
            data:
              x: "{{ x }}"
              y: "{{ y }}"
              direction: 'down'
              moving: false
        - think: 1
        count: 10
      - think: 10